<?php

namespace Database\Seeders;

use App\Models\Service;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;


class ServicesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $services = [
            [
                'name'          => 'تدقيق و مراجعة القوائم المالية',
                'description'   => 'تعتبر خدمات تدقيق القوائم المالية واعتمادها من اهم الخدمات التي تحتاجها الشركة ، وذلك لأضافه ثقة على قوائمها المالية ولا يقتصر على ذلك فهناك الملاحظات التي تتلقاها المنشأة اثناء التدقيق  والفحص سواءً على النظام المحاسبي أو على نظام الرقابة الداخلي او غيره والتي من شأنها ان تعود على المنشأة بالمنفعة العامة .',
                'description2'  => 'يقوم المكتب بتقديم خدمة تدقيق الحسابات لعدة منشآت في مختلف المجالات،  ويرتكز أسلـوب التدقيق المعتمـد لدينا على مفهـوم تحليل عناصر المخاطرة ومعالجتها والتخطيـط الفعال لفهم النشاط ، كما يتم تحديد لمواطن الضعف والخلل بالإضافة إلى المخاطر المحتملة التي قد تتعرض لها المنشآت وطرح حلول لمعالجتها لتحسين أدائها في المستقبل وهـو الأمـر الـذي يعتبر مصدرا للتخطيط والتنظيم لتعظيم الأرباح وترشيد النفقات .',
                'image'         => 'icons/1.png',
            ],
            [
                'name'          => 'الاستشارات المالية والتحليل المالي',
                'description'   => 'الاستشارات المالية تعني أشياء مختلفة لأشخاص مختلفين، اعتمادًا على احتياجاتهم وأهدافهم المختلفة، سواء كان الأمر يتعلق بالحصول على شؤونك من أجل تحسين استثماراتك الحالية، أو من أجل موقفك تجاه المال و مخاطر الاستثمار ، وأين أنت و ماذا تريد تحقيقه ، و للاستفادة من الفرص الجديدة، فإن الحصول على الاستشارات المالية من خبير مالي مؤهل يمكن أن يساعدك في تحقيق أهدافك في وقت أقرب، وبثقة أكبر.',
                'description2'  => 'تعتبر خدمات الاستشارات المالية من الأمور المهمة لنجاح المنشأة ومن تلك الخدمات على سبيل المثال لا الحصر :',
                'description3'  => 'تقوم خدماتنا على المشورة المالية والاقتصادية والاستراتيجية للشركات التي تواجه تحديات أو معاملات تجارية معقدة ، كما يعد التحليل المالي جزءًا حيويًا من أي منشأة مستدامة ومربحة لأن المحترف في تحليل البيانات المالية فقط هو الذي يمكنه التحكم في مؤشرات الأداء والصحة العامة للميزانية في المنشأة، من خدماتنا في هذا المجال (التنبؤ بالوضع المالي، تقييم الكفاءة في السياسة المالية المتبعة ، دراسة التدفق النقدي للمنشأة ،..) ',
                'image'         => 'icons/2.png',
                'details' => [
                    [
                        'name' => 'انشاء ومراجعة السياسات والإجراءات المالية .',
                    ],
                    [
                        'name' => 'تكوين ومراجعة النظام المالي بالشركة .',
                    ],
                    [
                        'name' => 'التحليل المالي والمؤشرات المالية للشركة .',
                    ],
                    [
                        'name' => 'الخدمات المالية الأخرى ذات العلاقة .',
                    ],
                ],
            ],
            [
                'name'          => 'الاستشارات الادارية',
                'description'   => 'و ضع النظام الداخلي للمنشأة (اللوائح المالية والادارية ) و التي تهدف الي بيان القواعد الأساسية للنظام المالي والاداري التي يراعي إتباعها لدى الشركات .',
                'image'         => 'icons/3.png',
            ],
            [
                'name'          => 'خدمات الضرائب ( ضريبة الدخل و المبيعات ) ',
                'description'   => 'إن الاهتمام المتزايد الذي توليه قانون الضريبة و القوانين ذات الصلة  لكافة الشؤون الضريبية المتعلقة بمختلف أنواع الأعمال  يزيد من أهمية العمل الضريبي و توثيقه و إنشاء التقارير الضريبية تبعا لذلك ، خدماتنا الضريبية منها ( تدقيق و تقديم الإقرار الضريبي ، المناقشة الضريبية ،تقديم الحلول للمشكلات الضريبية ، انجاز الاعمال الضريبية الأخرى بحسب متطلبات القانون ،...)',
                'image'         => 'icons/4.png',
            ],
            [
                'name'          => 'الخدمات المحاسبية و مسك الدفاتر ',
                'description'   => 'إن الغاية الأساسية من تقديم خدماتنا المحاسبية هي مساعدة رواد الأعمال للتركيز على الوظائف و المهام الأساسية للعمل و التركيز عليها  و بالتالي زيادة معدل الانتاجية و نجاح العمل ، خدماتنا  محاسبية  (تسجيل العمليات المالية بشكل منتظم عبر برنامج محاسبي ، اعداد التقارير المحاسبية ، ..) ، وتتم من قبل فريقنا المؤهل والملم بجميع الجوانب المحاسبية ويكون ذلك عن طريق الزيارة الميدانية للعميل او عن بعد .',
                'image'         => 'icons/5.png',
            ],
            [
                'name'          => 'خدمة التدقيق الداخلي ',
                'description'   => 'من أجل العمل بكفاءة أكبر، يتعين على الشركات أن تحلل باستمرار عمليات الرقابة الداخلية ، كما يساعد تقييم إجراءات الجودة وتحسين فعالية هذه الإجراءات على البقاء على طريق النجاح، لذلك فان خدماتنا في التدقيق الداخلي يمكن المنشأة ويساعد الإدارة من التأكد من اعمالها المحاسبية و إدارة المستودعات و المشتريات و المبيعات و نساعدها من معرفة نقاط الضعف في الرقابة لتلك الأقسام ، كما نقدم الحلول للأقسام التي بها ضعف في الإجراءات و الأنظمة .',
                'image'         => 'icons/6.png',
            ],
            [
                'name'          => 'اعادة هيكلة الشركات ',
                'description'   => 'هو إجراء التصويب اللازم للهياكل الفنية والاقتصادية والمالية للمنشأة على النحو الذي يمكن المنشأة من البقاء بل والاستمرار بنجاح وتحقيق عائد مناسب فالهدف الأساسي للمنشأة يتمثل في البقاء في دنيا الأعمال بحيث تعتبر المنشأة قادرة على البقاء فنيا واقتصاديا وماليا وقانونيا ، ان خدماتنا قادرة على اجراء التصويب اللازم لكل الأقسام في المنشأة وبكفاءة عالية وبشكل مهني ومميز .',
                'image'         => 'icons/7.png',
            ],
            [
                'name'          => 'خدمات احتساب زكاة المال ',
                'description'   => 'الزكاة فريضة الهيه وعبادة مالية وشعيرة تكافلية مجتمعية ، فهي أوسط اركان الإسلام الخمسة ،و ان الشرع الحكيم لم يترك نظام الزكاة خاضعا للأهواء والعقلية و الأمزجة البشرية و انما بنظام خاص للزكاة ، واننا في مكتب مٍسْك الاعمال لتدقيق الحسابات نقدم تلك الخدمة لعملائنا مجانا نبتغي به الأجر .',
                'image'         => 'icons/8.png',
            ],
            [
                'name'          => 'خدمات اخرى ',
                'description'   => 'كون ان الخدمات المالية والمحاسبية متعددة ولا يمكن حصرها ولذلك نشير على اننا على استعداد لتقديم الخدمات الاخرى ذات العلاقة والتي لم يتم ذكرها .',
                'image'         => 'icons/9.png',
            ],
        ];

        foreach ($services as $service) {
            $service_object = Service::create([
                'name'          => $service['name'],
                'description'   => $service['description'],
                'description2'  => $service['description2'] ?? null,
                'description3'  => $service['description3'] ?? null,
                'image'         => $service['image'],
            ]);
            if (isset($service['details'])) {
                $service_object->details()->createMany($service['details']);
            }
        }
    }
}
